# 5) შექმენით სტრინგის ცვლადი და ცარიელი სია, თუ სტრინგის ასო არის პატარა, მაშინ ცარიელ სიაში ჩაამატეთ "%" ნიშანი, ხოლო თუ სტრინგის ასო არის დიდი, მაშინ ცარიელ სიაში ჩაამატეთ "@" ნიშანი. თუ მინუსების რაოდენობა სიაში არის ლუწი, მაშინ წაშალე ყველა "%" ნიშანი, ხოლო თუ მინუსების რაოდენობა სიაში არის კენტი, წაშალე ყველა "@" ნიშანი. "%" და "@" -ების თავიდან სიაში ჩასაგდებად გამოიყენეთ for ციკლი, ხოლო "%" ან "@" -ების წასაშლელად გამოიყენეთ while ციკლი.

text = "ACADEMY"
list1 = []


for i in range(len(text)):
    if text[i] == text[i].lower():
        list1.append("%")
    else:
        list1.append("@")


count_percent = list1.count("%")


i = 0
while i < len(list1):
    if count_percent % 2 == 0:
        
        if list1[i] == "%":
            list1.pop(i)
        else:
            i += 1
    else:
        
        if list1[i] == "@":
            list1.pop(i)
        else:
            i += 1

print(list1)
