// 2)შექმენით ორი სია,ერთში იყოს სტრინგები მეორეში რიცხვები,ორივე სიაში იყოს ხუთ ხუთი ელემენტი , შენი დავალებაა ეს ორი სია ერთმანეთში გაააერთიანო, ამის შემდეგ ამ გაერთიანებულ სიის ბოლოში დაამატე true და ამოშალე პირველი ელემენტი

// ამის შემდეგ შენი დავალებაა რომ შექმნა ახალი სია სადაც იქნება მესამე ინდექსიდან მეექვსე ინდექსამდე ელემენტები .slice() გამოყენებით და დაბეჭდო ეს ახალი სია,შემდეგ Array.isArray() ის დახმარებით დაბეჭდე არის თუ არა ეს ახალი მიღებული მნშვნელობა მანდვილად სია

let strings = ["hello", "zaza", "world", "sun", "car"]

let numbers = [2, 4, 6, 2335, 2]

let newArray = strings.concat(numbers)

newArray.push(true)
newArray.shift()

let newArray2 = newArray.slice(3, 7)

console.log(newArray2)
console.log(Array.isArray(newArray2))