// const scores = [45, 80, 25, 90, 60, 35, 100, 70];


// შენი დავალებაა reduce() მეთოდის გამოყენებით იპოვო იმ ქულების ჯამი, რომლებიც 50-ზე მეტია ან ტოლია.
// პირობები
// 1. გამოიყენე მხოლოდ reduce() მეთოდი.
// 2. ჯამში უნდა მოხვდეს მხოლოდ ის ქულები, რომლებიც 50-ზე მეტია ან ტოლია.
// 3. თუ ქულა 50-ზე ნაკლებია, ჯამი უცვლელი უნდა დარჩეს.
// 4. საბოლოო შედეგი შეინახე sum ცვლადში და გამოიტანე console.log()-ით.

const scores = [45, 80, 25, 90, 60, 35, 100, 70]

let sum = scores.reduce(function(acc, curr) {
    if (curr >= 50) {
        return acc + curr
    } else {
        return acc
    }
}, 0)

console.log(sum)