# 2) მომხმარებელს შემოატანინე ორი რიცხვი:
# --> ქულა (score)
# --> დასწრება (attendance პროცენტებში)
# შემდეგ შეამოწმე:
# თუ ქულა მეტია 80-ზე და დასწრება მეტია 90-ზე -> "შენ შესანიშნავად დაწერე გამოცდა"
# თუ ქულა მეტია 50-ზე და დასწრება მეტია 70-ზე -> "საშუალოდ დაწერე გამოცდა"
# თუ ქულა მეტია 30-ზე ან დასწრება მეტია 50-ზე -> "გაჭირვებით, მაგრამ ჩააბარე გამოცდა"
# ყველა სხვა შემთხვევაში → "ჩაიჭერი!"

score=int(input("Enter score:"))
attend=int(input("Enter attendance rate:"))

if score>80 and attend>90:
    print("შენ შესანიშნავად დაწერე გამოცდა")
elif score>50 and attend>70:
    print("შაშუალოდ დაწერე გამოცდა")    
elif score>30 and attend>50:
    print("გაჭირვებით,მაგრამ ჩააბარე გამოცდა")
else:
    print("ჩაიჭერი!")    