// 10)შექმენი ფუნქცია calculateSum, რომელსაც გადაეცემა რიცხვი n.

// ფუნქციაში შექმენი ცვლადი sum, რომლის საწყისი მნიშვნელობა იქნება 0.

// ციკლის გამოყენებით იპოვე 1-დან n-ის ჩათვლით რიცხვების ჯამი და დააბრუნე შედეგი.

// ფუნქციის გარეთ შექმენი სხვა ცვლადი სახელად sum და შეამოწმე, შეიცვალა თუ არა მისი მნიშვნელობა ფუნქციის შესრულების შემდეგ.


function calculateSum(n) {
    let sum = 0
    for(let i = 1; i <= n; i++) {
        sum += i
    }
    return sum
}
let sum = 0
console.log(calculateSum(5))
console.log(sum)