// 2) თქვენი დავალებაა:
// 2.1 სერვერმა გამოგზავნა ქსელური პაკეტების კოდების მასივი (რიცხვები). კრიტიკული უსაფრთხოების ასამუშავებლად, ჯერ უნდა შეამოწმო, არის თუ არა სისტემაში თუნდაც ერთი უკიდურესად საშიში ვირუსული პაკეტი (რიცხვი, რომელიც იყოფა 7-ზე და მეტია 500-ზე). თუ ეს დადასტურდა, უნდა ამოიღო მხოლოდ ის პაკეტები, რომლებიც ლეგიტიმურია (ლეგიტიმურია პაკეტი, თუ ის დადებითია, არ იყოფა 3-ზე და ნაკლებია 1000-ზე).
// მასივი: const packets = [120, 505, -45, 999, 14, 700, 33, 842];


const packets = [120, 505, -45, 999, 14, 700, 33, 842]

if (packets.some(item => item % 7 === 0 && item > 500)) {
    console.log(packets.filter(item => item > 0 && item % 3 !== 0 && item < 1000))
}