// 3) თქვენი დავალებაა:
// 3.1 საწყისი ენერგიის დონეების მასივიდან უნდა გაფილტრო მხოლოდ ის ენერგიები, რომლებიც მეტია 10-ზე და ნაკლებია 150-ზე. ამის შემდეგ, მიღებული შედეგი უნდა გარდაქმნა „კვანტურ კოეფიციენტად“: თითოეული ელემენტი გაამრავლო 3-ზე, გამოაკლო 5 და საბოლოოდ შედეგი გადაიყვანო სტრიქონშიპრეფიქსით "Q-" (მაგ: "Q-45").
// მასივი: const rawEnergies = [5, 45, 120, 200, 12, 88, -10, 150];


const rawEnergies = [5, 45, 120, 200, 12, 88, -10, 150]

let filtered = rawEnergies.filter(function(item) {
    return item > 10 && item < 150
})

let newList = filtered.map(function(item) {
    return "Q-" + (item * 3 - 5)
})

console.log(newList)