// let prices = [120, 45, 300, 80, 150, 25, 400];

// შექმენი პროგრამა, რომელიც:

// for ციკლით გადაუვლის ყველა ფასს.

// თუ ფასი 100-ზე მეტია, ფასს  20 იანფასდაკლებას გაუკეთებს.

// თუ ფასი 50-დან 100-მდეა, ფასს 10-იან ფასდაკლებას გაუკეთებს.

// სხვა შემთხვევაში ფასს არ შეცვლის.

// განაახლებს ფასებს თავდაპირველ მასივში.

// დაითვლის ფასდაკლებული პროდუქტების საერთო ღირებულებას (ჯამს).

// უკუღმა ციკლით დაბეჭდავს საბოლოო ფასებს.


let prices = [120, 45, 300, 80, 150, 25, 400]
let sum = 0

for(let i = 0; i < prices.length; i++) {

    if(prices[i] > 100) {
        prices[i] -= 20
        sum = sum + prices[i]
    } else if(prices[i] >= 50 && prices[i] <= 100) {
        prices[i] -= 10
        sum = sum + prices[i]
    }
}


for(let i = prices.length - 1; i >= 0; i--) {
    console.log(prices[i])
}