// 11)კომენტარის სახით ახსსენი თუ რა არის scope როგორი სკოუპებია რსებობს და ყველა მნშვნელოვანი ინფორმაცია რაც ვისწავლეთ

// Scope არის კოდის ის არე, სადაც ცვლადი ხელმისაწვდომია და მისი გამოყენება შეგვიძლია.Scope განსაზღვრავს, სად შეიძლება ცვლადის გამოყენება.

// JavaScript-ში არსებობს 3 მნიშვნელოვანი Scope:
// 1) Global Scope
// ცვლადი არის Global Scope-ში, როცა ის ფუნქციისა და ბლოკის გარეთ არის შექმნილი.
// Global ცვლადზე წვდომა შესაძლებელია კოდის სხვადასხვა ადგილიდან.
// 2) Local Scope
// ცვლადი არის Local Scope-ში, როცა ის ფუნქციის შიგნით არის შექმნილი.
// Local ცვლადი ხელმისაწვდომია მხოლოდ იმ ფუნქციის შიგნით,
// სადაც ის შეიქმნა.
// 3) Block Scope
// Block Scope არის { } შიგნით არსებული Scope.
// let და const-ით შექმნილ ცვლადებს აქვთ Block Scope.
// ასეთი ცვლადი ხელმისაწვდომია მხოლოდ იმ { } ბლოკის შიგნით,
// სადაც ის შეიქმნა.
// შიდა Scope-ს შეუძლია გარეთა Scope-ში არსებული ცვლადის გამოყენება,
// მაგრამ გარეთა Scope-ს არ შეუძლია შიდა Scope-ში შექმნილი ცვლადის გამოყენება.
//
// JavaScript ცვლადს ჯერ საკუთარ Scope-ში ეძებს.თუ ვერ იპოვა, შემდეგ გარეთა Scope-ში ეძებს.შემდეგ კიდევ უფრო გარეთ გადადის.
// Global Scope → ყველგან ხელმისაწვდომი
// Local Scope → ფუნქციის შიგნით ხელმისაწვდომი
// Block Scope → { } ბლოკის შიგნით ხელმისაწვდომი