# 6) მომხმარებელს შეაყვანინე ასაკი მანამ, სანამ არ შეიყვანს -1. დაბეჭდე რამდენი ადამიანი იყო არასრულწლოვანი, სრულწლოვანი, პენსიონერი. გამოიყენე while loop + if/elif/else

არასრულწლოვანი = 0
სრულწლოვანი = 0
პენსიონერი = 0

age = int(input("შეიყვანე ასაკი (-1 გასაჩერებლად): "))

while age != -1:
    if age < 18:
        არასრულწლოვანი += 1
    elif age <= 64:
        სრულწლოვანი += 1
    else:
        პენსიონერი += 1

    age = int(input("შეიყვანე ასაკი(-1 გასაჩერებლად): "))

print("არასრულწლოვანი:", არასრულწლოვანი)
print("სრულწლოვანი:", სრულწლოვანი)
print("პენსიონერი:", პენსიონერი)
