# 5) შექმენით ფუნქცია. შექმენი რიცხვებით სავსე სია, სადაც დუბლიკატები - ანუ გამეორებული ელემენტები აღარ იქნება, მაგრამ ელემენტების თანმიმდევრობა შენარჩუნდეს. მაგალითად თუ მოცემული გვქონდა სია: [1, 2, 2, 3, 3, 4, 5, 6, 5], უნდა დავპრინტოთ [1, 2, 3, 4, 5, 6]. გამოიყენე for ციკლი და if. გამოიძახეთ ფუნქცია.

def number():
    numbers = [1, 2, 3, 3, 4, 4, 5, 5, 5, 6, 7, 8, 7]
    new_list = []

    for i in numbers:
        if i not in new_list:
            new_list.append(i)
    print(new_list)
number()
