# 0)კომენტარის სახით ახსენით თუ რა არის muttable და რა არის immutable

# ახსენით რატომ არის სია mutable

# ახსენით რატომ არის სტრინგი იმმუტაბლე


# Mutable ნიშნავს ისეთ მონაცემის ტიპს, რომლის შეცვლაც შესაძლებელია შექმნის შემდეგ,მაგალითად სია  არის mutable, რადგან შეგვიძლია მისი ელემენტის შეცვლა, დამატება ან წაშლა ისე, რომ ახალი სია არ შევქმნათ

# Immutable ნიშნავს ისეთ მონაცემის ტიპს, რომლის შეცვლაც შეუძლებელია შექმნის შემდეგ,მაგალითად სტრინგი არის immutable

# სტრინგი არის immutable, რადგან მისი კონკრეტული სიმბოლოს შეცვლა პირდაპირ ინდექსით არ შეგვიძლია თუ გვინდა ტექსტის შეცვლა, უნდა შევქმნათ ახალი სტრინგი