// 2)შენი დავალებაა შექმნა ფუნქცია და გადასცე სამი პარამეტრი(შენი სურვილით) ასევე ამ სამივე პარამეტრს მიანიჭე დეფაულთ მნიშვნელობები , შენი დაალბაა ფუნქციამ დააკონსოლლოგოს რაიმე წინადადება სადაც გამოყენებული იქნება ყველა ეს პარამეტრი , გამოიძახე ფუნქცია ოთხჯერ შემდეგნაირად --> არგუმენტი მიანიჭე მხოლოდ პირველ პარამეტრს და ნახე შედეგი , არგუმენტი მიანშე პირველ და მეორე პარამეტრს და ნახე შედეგი , არგუმენტი მიანიჭე სამივე პარამეტრს და ნახე შედეგი , არგუმენტი არ მიანიჭო არც ერთ პარამეტრს და ნახე შედეგი

function parameters(name = "zaza", age = 15, city = "kutaisi") {
    console.log(`My name is ${name} I am ${age} years old and I live in ${city}`)
}

parameters("Gio")
parameters("Gio", 16)
parameters("Gio", 16, "Tbilisi")
parameters()