// 1)შექმენი ორი კამათელი:

// let dice1 = ...
// let dice2 = ...

// ორივე კამათლის მნიშვნელობა შემთხვევით უნდა შეიქმნას 1-დან 6-მდე.

// პროგრამამ უნდა:

// დაბეჭდოს ორივე კამათლის შედეგი.
// გამოთვალოს მათი ჯამი.
// თუ ჯამი არის 10 ან მეტი → დაბეჭდოს "ძალიან კარგი შედეგია!"
// თუ ჯამი არის 7-დან 9-მდე → "კარგი შედეგია!"
// თუ ჯამი 7-ზე ნაკლებია → "ცუდი შედეგია!"

// დამატებითი წესი:
// თუ ორივე კამათზე ერთი და იგივე რიცხვი ამოვიდა, დაბეჭდე:

// "დუბლი!"


let dice1 = Math.floor(Math.random() * 6) + 1
let dice2 = Math.floor(Math.random() * 6) + 1

console.log(dice1)
console.log(dice2)

let sum = dice1 + dice2
console.log(sum)

if(sum >= 10) {
    console.log("ძალიან კარგი შედეგია!")
} else if(sum >= 7 && sum <= 9) {
    console.log("კარგი შედეგია!")
} else if(sum < 7) {
    console.log("ცუდი შედეგია!")
}

if(dice1 === dice2) {
    console.log("დუბლი!")
}