// 3)შექმენი მანქანის შემთხვევითი სიჩქარე 40-დან 120-მდე.

// პროგრამამ უნდა განსაზღვროს:

// 40-დან 60-მდე → "ნელა მიდის"
// 61-დან 90-მდე → "ნორმალური სიჩქარე"
// 91-დან 110-მდე → "სწრაფად მიდის"
// 111-დან 120-მდე → "ძალიან სწრაფად მიდის"

// დამატებითი წესი:
// თუ სიჩქარე ზუსტად 100 აღმოჩნდა, დაბეჭდე:

// "ზუსტად 100 კმ/სთ!"

// ეს შეტყობინება ჩვეულებრივ კატეგორიასთან ერთად უნდა გამოვიდეს.

let speed = Math.floor(Math.random() * 81) + 40

console.log(speed)

if(speed >= 40 && speed <= 60) {
    console.log("ნელა მიდის")
} else if(speed >= 61 && speed <= 90) {
    console.log("ნორმალური სიჩქარე")
} else if(speed >= 91 && speed <= 110) {
    console.log("სწრაფად მიდის")
} else if(speed >= 111 && speed <= 120) {
    console.log("ძალიან სწრაფად მიდის")
}

if(speed === 100) {
    console.log("ზუსტად 100 კმ/სთ!")
}