// 4)შექმენი შემთხვევითი რიცხვი 1-დან 10-მდე, რომელიც წარმოადგენს მოთამაშის მიერ არჩეულ ყუთს.

// შემდეგ თითოეული რიცხვისთვის განსაზღვრე რა შეხვდა მოთამაშეს:

// 1-3 → "ცარიელი ყუთი"
// 4-6 → "10 მონეტა"
// 7-8 → "30 მონეტა"
// 9 → "50 მონეტა"
// 10 → "100 მონეტა და ბონუსი!"

// მაგრამ აქ დამატებითი პირობაა:

// თუ მოთამაშემ მიიღო 10, შექმენი კიდევ ერთი შემთხვევითი რიცხვი 1-დან 5-მდე.

// თუ მეორე რიცხვი 5 გამოვიდა → "სუპერ ბონუსი!"
// სხვა შემთხვევაში → "ჩვეულებრივი ბონუსი!"

let box = Math.floor(Math.random() * 10) + 1

if(box >= 1 && box <= 3) {
    console.log("ცარიელ ყუთი")
} else if(box >= 4 && box <= 6) {
    console.log("10 მონეტა")
}else if(box >= 7  && box <= 8) {
    console.log("30 მონეტა")
}else if(box === 9) {
    console.log("50 მონეტა")
} else if(box === 10) {
    console.log("100 მონეტა და ბონუსი!")
    let box1 = Math.floor(Math.random() * 5) + 1
    if(box1 === 5){
        console.log("სუპერ ბონუსი!")
    } else {
        console.log("ჩვეულებრივი ბონუსი!")
    }
}