// 6)შექმენი სამი შემთხვევითი რიცხვი:

// პირველი → 1-დან 20-მდე
// მეორე → 1-დან 20-მდე
// მესამე → 1-დან 20-მდე

// შემდეგ პროგრამამ უნდა შეამოწმოს:

// თუ სამივე რიცხვი ერთმანეთის ტოლია → "ჯეკპოტი!"
// თუ მხოლოდ ორი რიცხვია ტოლი → "ორი ერთნაირი რიცხვი!"
// თუ სამივე განსხვავებულია → "სამივე განსხვავებულია"

// მაგრამ შემდეგ კიდევ ერთი შემოწმება გააკეთე:

// სამივე რიცხვის ჯამი:

// თუ 40-ზე მეტია → "დიდი ჯამი"
// თუ 40 ან ნაკლებია → "პატარა ჯამი"

// ანუ პროგრამამ უნდა გამოიტანოს ორივე შედეგი.


let num1 = Math.floor(Math.random() * 20) + 1
let num2 = Math.floor(Math.random() * 20) + 1
let num3 = Math.floor(Math.random() * 20) + 1

let sum = num1 + num2 + num3

console.log(num1)
console.log(num2)
console.log(num3)

if(num1 === num2 && num2 === num3) {
    console.log("ჯეკპოტი!")
} else if(num1 === num2 || num2 === num3 || num1 === num3) {
    console.log("ორი ერთნაირი რიცხვი!")
} else {
    console.log("სამივე განსხვავებულია")
}

if(sum > 40) {
    console.log("დიდი ჯამი")
} else {
    console.log("პატარა ჯამი")
}